USE `sorc_db`;

INSERT INTO `unit`(`name`,`symbol`) VALUES 
    ('метр','м'),
    ('квадратный метр','м^2'),
    ('кубический метр','м^3'),
    ('штука','шт'),
    ('килограмм','кг'),
    ('грамм','гр'),
    ('тонна','т'),
    ('литр','л'),
    ('миллилитр','мл');

INSERT INTO `production` (`code`, `name`) VALUES 
    ('CODE_01001','Шариковая ручка Parker "Jotter Stainless Steel GT"'),
    ('CODE_01002','Бумага Ballet Universal'),
    ('CODE_01003','Офисный стул Iso Black'),
    ('CODE_01004','Клавиатура Logitech Wireless Solar Keyboard K750'),
    ('CODE_01005','Монитор LCD LG E1942C-BN '),
    ('CODE_01006','Мышь Logitech M105'),
    ('CODE_01007','Системный блок «ПЭВМ Jet A (12U154)»'),
    ('CODE_01008','Офисный стол от ООО "Мебель для офиса"'),
    ('CODE_01009','Огнетушитель порошковый ОП-4 МИГ'),
    ('CODE_01010','Сетевой кабель utp5e 4х2х0.5'),
    ('CODE_01011','Дырокол "Неженка"'),
    ('CODE_01012','Изделие световодное ИС-2 бис'),
    ('CODE_01013','Набор зажимов "Универсал"'),
    ('CODE_01014','Карандаш простой "Технолог"');

INSERT INTO `plan_change` (`date`) VALUES 
    ("2013-04-21"),
    (NULL);

/*yy-mm-dd*/
INSERT INTO `plan` (`position`, `product_id`, `name`, `price`, `amount`, `begin`, `end`, `unit_id`, `comment`, `plan_change_id`) VALUES 
    (1,1,"Шариковая ручка Parker",3500.0,50.0, "2013-12-01", "2013-12-31",4,'Для кафедры',1),
    (2,2,"Бумага Ballet",80000.0,5.0,"2013-03-01","2013-03-31",4,'Для нужд кафедры',1),
    (3,3,"Офисный стул Iso",200000.0,8.0,"2013-02-01","2013-02-28",4,NULL,1), 
    (4,4,"Клавиатура Logitech",150000.0,12,"2013-02-15","2013-02-20",4,'Для аудитории',1), 
    (5,5,"Монитор LCD LG",600000.0,12.0,"2013-02-07","2013-02-28",4,'Для аудитории',1), 
    (6,6,"Мышь Logitech",100000.0,12.0,"2013-07-02","2013-07-20",4,'Для аудитории',1), 
    (7,7,"Системный блок",5000000.0,12.0,"2013-06-01","2013-06-30",4,'Для аудитории',1), 
    (8,8,"Офисный стол",300000.0,15,"2013-2-07","2013-02-10",4,NULL,1), 
    (9,9,"Огнетушитель порошковый",250000.0,2,"2013-02-12","2013-02-24",4,NULL,1), 
    (10,10,"Сетевой кабель utp5e",4000.0,50.0,"2013-02-10","2013-02-28",1,NULL,1), 
    (11,11,"Дырокол",60000.0,5.0,"2013-02-10","2013-02-28",4,NULL,1), 
    (12,12,"Световод",400000.0,1.0,"2013-02-10","2013-02-28",4,NULL,1), 
    (13,13,"Набор зажимов",40000.0,15.0,"2013-02-10","2013-02-28",4,NULL,1),
    (14,14,"Карандаш",2000.0,12.0,"2013-06-01","2013-06-30",4,'Для кафедры',1), 
    (15,11,"Дырокольчик:)",60000.0,1.0,"2013-06-01","2013-06-30",4,'Для нужд университета',1),
    (1,1,"Шариковая ручка Parker",3500.0,50.0, "2013-12-01", "2013-12-31",4,'Для кафедры',2),
    (2,2,"Бумага Ballet",80000.0,5.0,"2013-03-01","2013-03-31",4,'Для нужд кафедры',2),
    (3,3,"Офисный стул Iso",200000.0,8.0,"2013-02-01","2013-02-28",4,NULL,2), 
    (4,4,"Клавиатура Logitech",150000.0,12,"2013-02-15","2013-02-20",4,'Для аудитории',2), 
    (5,5,"Монитор LCD LG",600000.0,12.0,"2013-02-07","2013-02-28",4,'Для аудитории',2), 
    (6,6,"Мышь Logitech",100000.0,12.0,"2013-07-02","2013-07-20",4,'Для аудитории',2), 
    (7,7,"Системный блок",5100000.0,12.0,"2013-06-01","2013-06-30",4,'Для аудитории',2),
    (8,6,"Мыш",120000.0,1.0,"2013-06-01","2013-06-30",4,'Для нужьд уневерситет',2);